vlm/base/InformationRegisters/ИсторияИзмененияФорматовМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияФорматовМагазинов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФорматМагазина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыМагазинов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьАссортимент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничныеЦеныИзФорматаМагазина</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/ИсторияИзмененияФорматовМагазинов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текущий формат магазина установленного на складе
//
// Параметры:
//  Склад  - СправочникСсылка.Склады - Склад для которого необходимо получить формат
//  НаДату  - Дата - Необязательный. Дата, на которую получается формат, по умолчанию - текущая дата.
//
// Возвращаемое значение:
//   СправочникСсылка.ФорматыМагазинов   - текущий формат магазина для склада.
//
Функция ТекущийФормат(Склад, НаДату = Неопределено) Экспорт 
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияИзмененияФорматовМагазиновСрезПоследних.ФорматМагазина
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияФорматовМагазинов.СрезПоследних(&НаДату, Склад = &Склад) КАК ИсторияИзмененияФорматовМагазиновСрезПоследних";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ФорматМагазина;
	КонецЕсли;
	
	Возврат Справочники.ФорматыМагазинов.ПустаяСсылка();

КонецФункции
 
// Возвращает текущий формат магазина установленного на складе
//
// Параметры:
//  Склад  - СправочникСсылка.Склады - Склад для которого необходимо получить формат
//  НаДату  - Дата - Необязательный. Дата, на которую получается формат, по умолчанию - текущая дата.
//
// Возвращаемое значение:
//   СправочникСсылка.ФорматыМагазинов   - текущий формат магазина для склада.
//
Функция ТекущийНастройкиАссортимента(Склад, НаДату = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Настройки = Новый Структура;
	Настройки.Вставить("КонтролироватьАссортимент", Ложь);
	Настройки.Вставить("ФорматМагазина", Справочники.ФорматыМагазинов.ПустаяСсылка());
	Настройки.Вставить("РозничныеЦеныИзФорматаМагазина", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияИзмененияФорматовМагазиновСрезПоследних.ФорматМагазина,
	|	ИсторияИзмененияФорматовМагазиновСрезПоследних.КонтролироватьАссортимент,
	|	ИсторияИзмененияФорматовМагазиновСрезПоследних.РозничныеЦеныИзФорматаМагазина
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияФорматовМагазинов.СрезПоследних(&НаДату, Склад = &Склад) КАК
	|		ИсторияИзмененияФорматовМагазиновСрезПоследних";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Настройки;

КонецФункции

#КонецОбласти

#КонецЕсли
